/*
****************************************Copyright(c)************************************
**                                  Zhengzhou GL. TECH Co.,Ltd
**___________________________File Info_________________________
**文件名称：lora_base_control.h
**工程项目：MIOT，TEST_BOARD,射频模块测试项目
**说    明：本文件用于MIOT项目中的TEST_BOARD硬件板，提供lora模块操作的基本函数
**
**作    者：吴树          日    期：2022年01月20日
**建立版本：V1.0
**
**________________________modification_________________________
**版本            日期               升级记录
**V1.0        2022年01月20日     初始版本构建
*****************************************************************************************
*/

#ifndef _LORA_BASE_CONTROL_H_
#define _LORA_BASE_CONTROL_H_

#include <stdint.h>
#include "lora_radio_control.h" //包含lora射频控制驱动

typedef enum
{
    GPIO_PULL_DISABLE = 0,
    GPIO_PULL_DOWN,
    GPIO_PULL_UP,
} GPIO_PULL_E;

/*
==================================================================
== 宏定义，根据模块数量分别定义
==================================================================
*/
#define MAX_LORA_NUM 1

/*
==================================================================
== 变量声明
==================================================================
*/
extern LORA_CHIPTYPE_E g_loraType[MAX_LORA_NUM];             // 定义系统中使用的射频模块类型
extern LORA_CONTROL_FUNC_T g_loraControlFuncs[MAX_LORA_NUM]; // lora基础操作函数，共外部调用lora驱动时使用

/*
==================================================================
== 函数声明
==================================================================
*/

/*
==================================================================
** 函数名称： LORA_GpioInit
** 功    能： lora模块引脚初始化
** 输入参数： num：对应的lora模块编号，从0开始
** 输出参数： 无
** 返    回： 无
==================================================================
*/
void LORA_HwInit(int num); // GPIO初始化函数，num表示对应的lora编号

void LORA1_GpioDeInit(void);

int LORA_GetFlagIRQ(int num);

void LORA1_DIO1_update_flag(uint8_t idx, uint8_t flag);
#endif
