lv_font_conv-win.exe --no-compress --no-prefilter ^
--bpp 4 --size 16 ^
--format lvgl -o ui_font_simfang16.c  ^
--font Montserrat-Medium.ttf -r 0x20-0x7F,0xB0,0x2022 --font FontAwesome5-Solid+Brands+Regular.woff -r 61441,61448,61451,61452,61452,61453,61457,61459,61461,61465,61468,61473,61478,61479,61480,61502,61507,61512,61515,61516,61517,61521,61522,61523,61524,61543,61544,61550,61552,61553,61556,61559,61560,61561,61563,61587,61589,61636,61637,61639,61641,61664,61671,61674,61683,61724,61732,61787,61931,62016,62017,62018,62019,62020,62087,62099,62212,62189,62810,63426,63650 ^
--font simfang.ttf --symbols ℃自定义用户环境温度一氧化碳氧气烟雾声光报警首页配置调试设置关于软件版本硬件版本输入输出关开名称通道地址串口地址从机地址删除新增恢复保存WIFI设置蓝牙设置lora设置退出掉线错误选择通道恢复成功保存成功错误码创建错误打开发送接收发送数据获取名称获取ip工作状态测量泵气罐压力时间流量预抽泵待机测量运行警告